In [19]:
import pandas as pd
import numpy as np
AGGREGATION_FUNCTIONS = ["mean", "max", "min", "sum", "count", "std", "skew"]
agg_dict = {
        "order_quantity_diff": AGGREGATION_FUNCTIONS,
        "order_price_diff": AGGREGATION_FUNCTIONS,
        "order_total_diff": AGGREGATION_FUNCTIONS,
    }

In [20]:
df = pd.read_csv("/opt/ml/code/input/train.csv", parse_dates=["order_date"])

In [335]:
order_df = df.groupby(["order_date", "customer_id"]).sum()

In [339]:
order_df = order_df.groupby(["customer_id"]).diff()

In [343]:
order_df["order_quantity_diff"] = order_df["quantity"]
order_df["order_price_diff"] = order_df["price"]
order_df["order_total_diff"] = order_df["total"]

In [344]:
order_df

,,quantity,price,total,order_quantity_diff,order_price_diff,order_total_diff
order_date,customer_id,,,,,,
2009-12-01 07:45:00,13085,NaN,NaN,NaN,NaN,NaN,NaN
2009-12-01 07:46:00,13085,-106.0,-36.5475,-593.1750,-106.0,-36.5475,-593.1750
2009-12-01 09:06:00,13078,NaN,NaN,NaN,NaN,NaN,NaN
2009-12-01 09:08:00,15362,NaN,NaN,NaN,NaN,NaN,NaN
2009-12-01 09:24:00,18102,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...
2011-11-30 17:32:00,14194,-408.0,-315.2820,-1879.7790,-408.0,-315.2820,-1879.7790
2011-11-30 17:34:00,14527,-51.0,-179.2230,-451.5390,-51.0,-179.2230,-451.5390
2011-11-30 17:37:00,15444,385.0,488.1525,1220.1915,385.0,488.1525,1220.1915
2011-11-30 17:39:00,15676,-87.0,45.4740,-427.6635,-87.0,45.4740,-427.6635
2011-11-30 17:42:00,16717,-929.0,-458.7990,-3301.1715,-929.0,-458.7990,-3301.1715

In [21]:
order_df = order_df.groupby(["customer_id"]).agg(agg_dict)

NameError: name 'order_df' is not defined

In [349]:
order_df

            order_quantity_diff                                    \
                           mean      max       min      sum count
customer_id
12346              -4639.062500  74216.0 -148430.0 -74225.0    16
12347                 27.833333    399.0    -287.0    167.0     6
12348                -39.000000    881.0    -653.0   -156.0     4
12349                159.000000    518.0    -472.0    636.0     4
12350                       NaN      NaN       NaN      0.0     0
...                         ...      ...       ...      ...   ...
18283                  4.150000    240.0    -109.0     83.0    20
18284               -495.000000   -495.0    -495.0   -495.0     1
18285                       NaN      NaN       NaN      0.0     0
18286                190.000000    510.0    -130.0    380.0     2
18287                 15.714286    734.0    -882.0    110.0     7

                                    order_price_diff                      ...  \
                      std      skew             mean       max       min  ...
customer_id                                                               ...
12346        42579.452576 -2.448920        -0.356813  190.1790 -410.9490  ...
12347          248.122080  0.244759        13.035000   86.6580  -27.0930  ...
12348          660.659771  1.206959        11.595375   58.0965  -12.5235  ...
12349          458.625483 -1.192913       239.641875  463.2540    8.9430  ...
12350                 NaN       NaN              NaN       NaN       NaN  ...
...                   ...       ...              ...       ...       ...  ...
18283           80.176302  1.261834         0.134475  201.6795 -161.3700  ...
18284                 NaN       NaN      -109.048500 -109.0485 -109.0485  ...
18285                 NaN       NaN              NaN       NaN       NaN  ...
18286          452.548340       NaN        12.292500  215.0775 -190.4925  ...
18287          574.185427 -0.433075        -0.146143  187.1100 -116.9190  ...

                                        order_total_diff               \
            count         std      skew             mean          max
customer_id
12346          16  136.474976 -1.626141     -7964.199375  127360.3650
12347           6   42.544458  1.122816       187.767250    1170.5265
12348           4   31.751638  1.722600        36.234000    1106.5560
12349           4  188.096741 -0.106816       734.951250    1984.3230
12350           0         NaN       NaN              NaN          NaN
...           ...         ...       ...              ...          ...
18283          20   95.938835  0.236663        10.181325     503.4150
18284           1         NaN       NaN      -803.022000    -803.0220
18285           0         NaN       NaN              NaN          NaN
18286           2  286.781297       NaN       305.687250    1553.4420
18287           7  110.376782  1.017175        17.862429    1776.5715


                     min          sum count           std      skew
customer_id
12346       -254705.8800 -127427.1900    16  73067.029667 -2.448619
12347          -418.6545    1126.6035     6    582.296093  0.815658
12348         -1097.8440     144.9360     4    910.374929 -0.200866
12349         -1433.0580    2939.8050     4   1573.108986 -1.203093
12350                NaN       0.0000     0           NaN       NaN
...                  ...          ...   ...           ...       ...
18283          -222.5685     203.6265    20    165.570226  1.267120
18284          -803.0220    -803.0220     1           NaN       NaN
18285                NaN       0.0000     0           NaN       NaN
18286          -942.0675     611.3745     2   1764.591690       NaN
18287         -1535.5560     125.0370     7   1183.306170 -0.081622

[5914 rows x 21 columns]

# 300 만들기

In [22]:
df["order_ts"] = df["order_date"].astype(np.int64) // 1e9

In [23]:
by = df.groupby(['customer_id', 'order_date']).sum()

In [24]:
by

                                 quantity     price     total      order_ts
customer_id order_date
12346       2009-12-14 08:34:00        10    7.4250    74.250  1.260780e+09
            2009-12-14 11:00:00         5    7.4250    37.125  1.260788e+09
            2009-12-14 11:02:00         5    7.4250    37.125  1.260789e+09
            2009-12-18 10:47:00         5    7.4250    37.125  1.261133e+09
            2009-12-18 10:55:00         1    1.6500     1.650  1.261134e+09
...                                   ...       ...       ...           ...
18287       2010-09-21 12:19:00        12    8.4150    50.490  2.570143e+09
            2010-11-22 11:51:00       187  124.8225   629.475  1.290427e+10
            2011-05-22 10:39:00       488   93.9180  1262.712  3.787576e+10
            2011-10-12 10:23:00       990   75.4050  1652.178  5.009977e+10
            2011-10-28 09:29:00       108    3.1845   116.622  3.959382e+09

[43721 rows x 4 columns]

# 300이상인 주문은 몇개인가?

In [25]:
by['sparta'] = (by["total"] > 300).astype(int)

In [26]:
by

                                 quantity     price     total      order_ts  \
customer_id order_date
12346       2009-12-14 08:34:00        10    7.4250    74.250  1.260780e+09
            2009-12-14 11:00:00         5    7.4250    37.125  1.260788e+09
            2009-12-14 11:02:00         5    7.4250    37.125  1.260789e+09
            2009-12-18 10:47:00         5    7.4250    37.125  1.261133e+09
            2009-12-18 10:55:00         1    1.6500     1.650  1.261134e+09
...                                   ...       ...       ...           ...
18287       2010-09-21 12:19:00        12    8.4150    50.490  2.570143e+09
            2010-11-22 11:51:00       187  124.8225   629.475  1.290427e+10
            2011-05-22 10:39:00       488   93.9180  1262.712  3.787576e+10
            2011-10-12 10:23:00       990   75.4050  1652.178  5.009977e+10
            2011-10-28 09:29:00       108    3.1845   116.622  3.959382e+09

                                 sparta
customer_id order_date
12346       2009-12-14 08:34:00       0
            2009-12-14 11:00:00       0
            2009-12-14 11:02:00       0
            2009-12-18 10:47:00       0
            2009-12-18 10:55:00       0
...                                 ...
18287       2010-09-21 12:19:00       0
            2010-11-22 11:51:00       1
            2011-05-22 10:39:00       1
            2011-10-12 10:23:00       1
            2011-10-28 09:29:00       0

[43721 rows x 5 columns]

In [36]:
dy = by[by['sparta'] > 0]
dy[:20]

                                 quantity     price        total  \
customer_id order_date
12346       2011-01-18 10:01:00     74215    1.7160  127352.9400
12347       2010-10-31 14:20:00       509  121.0440    1009.0245
            2010-12-07 14:57:00       319  147.8235    1174.4535
            2011-01-26 14:30:00       315  120.7305     784.3935
            2011-04-07 10:43:00       483  102.7785    1049.8125
            2011-06-09 13:01:00       196   88.4730     631.1580
            2011-08-02 08:48:00       277  112.5960     965.1015
            2011-10-31 12:25:00       676  199.2540    2135.6280
12348       2010-09-27 14:59:00       373   23.7435     366.5640
            2010-12-16 19:09:00      1254   81.8400    1473.1200
            2011-01-25 10:42:00       601   69.3165     375.2760
            2011-04-05 10:47:00       269   73.5900     605.5500
            2011-09-25 13:13:00       217   70.1250     511.5000
12349       2010-04-29 13:20:00       473  321.0570    1763.0580
            2010-05-18 09:57:00         1  330.0000     330.0000
            2010-10-28 08:23:00       519  793.2540    2314.3230
            2011-11-21 09:51:00       631  998.4150    2899.9575
12350       2011-02-02 16:01:00       197  107.7450     551.7600
12351       2010-11-29 15:23:00       261   81.6090     496.5345
12352       2010-11-29 10:07:00       111   69.5475     330.0825

                                     order_ts  sparta
customer_id order_date
12346       2011-01-18 10:01:00  1.295345e+09       1
12347       2010-10-31 14:20:00  5.154139e+10       1
            2010-12-07 14:57:00  4.004375e+10       1
            2011-01-26 14:30:00  3.758551e+10       1
            2011-04-07 10:43:00  3.125215e+10       1
            2011-06-09 13:01:00  2.353724e+10       1
            2011-08-02 08:48:00  2.887005e+10       1
            2011-10-31 12:25:00  6.204300e+10       1
12348       2010-09-27 14:59:00  2.571199e+10       1
            2010-12-16 19:09:00  2.197295e+10       1
            2011-01-25 10:42:00  7.775713e+09       1
            2011-04-05 10:47:00  6.510002e+09       1
            2011-09-25 13:13:00  3.950869e+09       1
12349       2010-04-29 13:20:00  5.853717e+10       1
            2010-05-18 09:57:00  1.274177e+09       1
            2010-10-28 08:23:00  7.085398e+10       1
            2011-11-21 09:51:00  9.649644e+10       1
12350       2011-02-02 16:01:00  2.204326e+10       1
12351       2010-11-29 15:23:00  2.711193e+10       1
12352       2010-11-29 10:07:00  1.549230e+10       1

In [29]:
agg_dict = {
        "order_ts": ["first", "last"],
        "sparta": ["sum","count"],
    }

In [30]:
dy = dy.groupby(['customer_id']).agg(agg_dict)

In [17]:
dy

                 order_ts               sparta
                    first          last    sum count
customer_id
12346        1.260780e+09  1.295346e+09      1    17
12347        5.154139e+10  6.204300e+10      7     7
12348        2.571199e+10  3.950869e+09      5     5
12349        6.299655e+09  9.649644e+10      4     5
12350        2.204326e+10  2.204326e+10      1     1
...                   ...           ...    ...   ...
18283        5.066399e+10  6.613290e+10      3    21
18284        3.601338e+10  1.286368e+09      1     2
18285        1.519683e+10  1.519683e+10      1     1
18286        2.143633e+10  6.411527e+10      2     3
18287        1.259677e+09  3.959382e+09      5     8

[5914 rows x 4 columns]

In [320]:
by['sparta', 'count']

customer_id
12346    17
12347     7
12348     5
12349     5
12350     1
         ..
18283    21
18284     2
18285     1
18286     3
18287     8
Name: (sparta, count), Length: 5914, dtype: int64

In [321]:
by['sparta_ratio'] = by['sparta', 'sum']/by['sparta', 'count']

In [322]:
by

            quantity            price            total       sparta        \
                 sum count        sum count        sum count    sum count
customer_id
12346             53    17   936.3750    17   -85.3710    17      1    17
12347           2775     7   892.6995     7  7749.5715     7      7     7
12348           2714     5   318.6150     5  3332.0100     5      5     5
12349           1619     5  2482.5735     5  7267.4910     5      4     5
12350            197     1   107.7450     1   551.7600     1      1     1
...              ...   ...        ...   ...        ...   ...    ...   ...
18283           1537    21  2617.2630    21  4053.8850    21      3    21
18284            493     2   191.5485     2   720.5220     2      1     2
18285            145     1   165.3300     1   704.5500     1      1     1
18286            592     3   505.8075     3  1960.9095     3      2     3
18287           3011     8   575.6685     8  6893.5185     8      5     8

            sparta_ratio

customer_id
12346           0.058824
12347           1.000000
12348           1.000000
12349           0.800000
12350           1.000000
...                  ...
18283           0.142857
18284           0.500000
18285           1.000000
18286           0.666667
18287           0.625000

[5914 rows x 9 columns]

In [323]:
by['sparta', 'sum']

customer_id
12346    1
12347    7
12348    5
12349    4
12350    1
        ..
18283    3
18284    1
18285    1
18286    2
18287    5
Name: (sparta, sum), Length: 5914, dtype: int64

In [324]:
by['sparta_ratio']

customer_id
12346    0.058824
12347    1.000000
12348    1.000000
12349    0.800000
12350    1.000000
           ...
18283    0.142857
18284    0.500000
18285    1.000000
18286    0.666667
18287    0.625000
Name: sparta_ratio, Length: 5914, dtype: float64

In [328]:
by = pd.DataFrame({'sparta':by['sparta', 'sum'], 'sparta_ratio':by['sparta_ratio']})
by

             sparta  sparta_ratio
customer_id
12346             1      0.058824
12347             7      1.000000
12348             5      1.000000
12349             4      0.800000
12350             1      1.000000
...             ...           ...
18283             3      0.142857
18284             1      0.500000
18285             1      1.000000
18286             2      0.666667
18287             5      0.625000

[5914 rows x 2 columns]

In [351]:
asd = pd.DataFrame(by["sparta"])
type(asd)

pandas.core.frame.DataFrame